# BoundingBoxUV Constructor (Double, Double, Double, Double) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BoundingBoxUV Constructor (Double, Double, Double, Double)
BoundingBoxUV Class See Also
---
Creates object with supplied values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public BoundingBoxUV(
	double min_u,
	double min_v,
	double max_u,
	double max_v
)
```

Visual Basic
---
```text
Public Sub New ( _
	min_u As Double, _
	min_v As Double, _
	max_u As Double, _
	max_v As Double _
)
```

Visual C++
---
```text
public:
BoundingBoxUV(
	double min_u,
	double min_v,
	double max_u,
	double max_v
)
```

# ### Parameters
min_u
    Type: System..::..DoubleThe first coordinate of min.
min_v
    Type: System..::..DoubleThe second coordinate of min.
max_u
    Type: System..::..DoubleThe first coordinate of max.
max_v
    Type: System..::..DoubleThe second coordinate of max.
# See Also
BoundingBoxUV Class
BoundingBoxUV Overload
Autodesk.Revit.DB Namespace